* One More Bears Questions Before Training Camp

#+name: post
#+BEGIN_SRC latex
It's going to be an interesting summer and there's a lot to look forward to as we all observe what the Bears do.  Leave it to \textbf{Brad Biggs} at the \textit{Chicago Tribune} to provide just enough insight into the state of the team heading into training camp.

Biggs provides a pretty comprehensive look at the questions that we'll all be looking for answers to this year by \href{http://www.chicagotribune.com/sports/football/bears/ct-spt-bears-ten-questions-training-camp-20180608-story.html}{pointing to 10 questions}.  The whole article is worth reading but I'll briefly state them here:

\begin{enumerate}
\item Is \textbf{Mitch Trubisky} the real deal?
\item Can the Bears finally stay healthy?
\item Is there enough talent and depth at outside linebacker?
\item Can \textbf{Allen Robinson} regain form?
\item Will the secondary have stickier hands?
\item Is \textbf{Jordan Howard} a good fit for the scheme?
\item Can \textbf{Kyle Fuller} replicate an outstanding season?
\item Will right guard \textbf{Kyle Long} return healthy and remain healthy?
\item Is \textbf{Trey Burton} ready to be a playmaker?
\item How will \textbf{Matt Nagy} juggle play-calling duties with being a head coach?
\end{enumerate}

This was a good article and one I'll keep handy as I consider how the Bears summer is progressing.  Having said that, I've got a couple more.  I've actually already addressed the first in  previous article, \href{http://bearingthenews.com/blog/2018/06/01/patience-new-bears-head-coach-may-usually-necessary/}{``What impact will the fact that Nagy is a first time head coach with limited experience even as a coordinator have on the team?''}.

The second one has occurred to me more and more as more information has leaked out about the new offense and how it will work.  ``How quickly can the players get up to speed with the new offense?''

This question has more than the usual amount significance this year with this team.  The reason is the complexity of the offense that Naby is bringing to the Bears.  It is going to require not only an inexperienced quarterback in Trubisky to read the defense correctly, it is more than usual going to require the receivers to do so as well.  This means that eveyone has to be on the same page not only when the ball is snapped but after the defense starts moving.  \textbf{Cliff Harris} at \textit{behindthesteelcurtain.com} \href{https://www.behindthesteelcurtain.com/2018/5/21/17368040/mason-rudolph-and-the-mental-part-of-playing-quarterback-for-the-steelers-nfl-ben-roethlisberger}{explains}.

\begin{quote}
  ``The most obvious way a QB and a receiver need to be “on the same page” is by understanding coverages. Teams tend to structure their passing concepts with built-in adjustments to the coverage they’re getting. If a defense presents cover-2 (two deep defenders), the outside receiver might run a vertical route to force one of the deep defenders to get all the way to the sideline to cover him. If it’s cover-3, however (three deep defenders), that vertical will not work. There are too many deep defenders to throw down the sideline here. Therefore, the outside receiver will convert his vertical route to an out or a comeback at 12-15 yards... If the quarterback or the receiver fail to properly diagnose the coverage and/or don’t know the proper adjustment, it can result in a sack, an interception, or one of those really ugly throws to nowhere that leaves the fans thinking, Who the hell was that to?
  
  ``Pro defenses do a great job of disguising coverages, so it’s rarely as simple as depicted above.''
\end{quote}

This goes far beyond simply recognizing a blitz and running a hot route.  The proper adjustments are going to have to be made quickly and everyone is going to have to react correctly.

To my knowldege the Bears haven't tried to impelment an offense this complicated in a very long time.  The last to coordinator to implement anything like this may have been \textbf{John Shoop} way back in the days when \textbf{Dick Jauron} was the head coach.  At that time it was a total disaster and we have rarely seen an offense as uncoordinated as that one since then.

In fairness, even back in those day, the offense wasn't the only problem.  The Bears flat out lacked talent and the recievers frequently sturggled to get off of the line of scrimmage.

Nevertheless, it was common to see the quarterback throw the ball to one spot while the reciever was going to another.  If they were lucky the ball went out of bounds or fell harmlessly to the ground.  If they weren't, a defender would be the only guys to be where the ball ended up going and an interception resulted.

I'm certainly not comparing Nagy to Shoop.  But what I am wondering is if the Bears are going to be able to avoid those problems as they try to learn this offense and act get together as a unit to make it work.  For an offense to execute, all 11 guys have to do thier job correctly.  The more complicated it is, the less likely it is that will be the case.

A lot is going to depend on how quickly the players can pick the offense up and, especially, how well it's taught.  If the new coaches, who are just learning the scheme themselves, can't convey the necessary information in a way that makes it easy for the players to pick up, the offense may never be executed to its potential.  Its going to be a terrible eye sore if that turns out to be the case.

Realistically it's possible - and perhaps likely - that we may be in for some ugly offensive football early in the season next year.  Perhaps it will eventually emerge as something beautiful.  And perhaps not.  Like the questions above, it will be a situation that will be worth keeping an eye on.

#+END_SRC

#+RESULTS: post
#+BEGIN_LaTeX

#END_LaTeX
